#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudfront_origin_access_identity.static-www: Refreshing state... [id=E13K0L3OQEMWND]
module.nginx_sg.aws_security_group.default: Refreshing state... [id=sg-05d50af2b833025ec]
module.nginx_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-40824367]
aws_s3_bucket.igsr5_images: Refreshing state... [id=igsr5-images]
module.nginx_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2680455915]
aws_ssm_parameter.igsr5_time_management_slack_app_token: Refreshing state... [id=/igsr5/time_management_slack/app_token]
aws_cloudwatch_log_group.prod_time_management_bolt: Refreshing state... [id=/ecs/igsr5/prod/time_management_bolt]
aws_s3_bucket.alb_log: Refreshing state... [id=alb-log-igsr5]
aws_ecs_cluster.igsr5: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:799705073177:cluster/igsr5]
aws_db_parameter_group.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_db_option_group.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_ssm_parameter.igsr5_time_management_slack_signing_secret: Refreshing state... [id=/igsr5/time_management_slack/signing_secret]
aws_s3_bucket.athena: Refreshing state... [id=athena-igsr5]
aws_ecr_repository.igsr5: Refreshing state... [id=igsr5]
aws_ssm_parameter.igsr5_time_management_slack_auth_user_name: Refreshing state... [id=/igsr5/time_management_slack/auth_user_name]
aws_ssm_parameter.igsr5_time_management_slack_bot_user_oauth_token: Refreshing state... [id=/igsr5/time_management_slack/bot_user_oauth_token]
aws_cloudwatch_log_group.prod_time_management_go: Refreshing state... [id=/ecs/igsr5/prod/time_management_go]
aws_ssm_parameter.igsr5_time_management_slack_auth_user_id: Refreshing state... [id=/igsr5/time_management_slack/auth_user_id]
aws_vpc.igsr5: Refreshing state... [id=vpc-0864c7ab6ca1d76a0]
aws_key_pair.igsr5_debug_server_key_pair: Refreshing state... [id=igsr5_debug_server]
aws_ssm_parameter.igsr5_time_management_slack_dsn: Refreshing state... [id=/igsr5/time_management_slack/dsn]
aws_cloudfront_distribution.igsr5: Refreshing state... [id=E1RBGUKSCTYFWY]
module.ecs_task_execution_role.aws_iam_role.default: Refreshing state... [id=ecs-task-execution]
aws_ecr_lifecycle_policy.igsr5: Refreshing state... [id=igsr5]
module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::799705073177:policy/ecs-task-execution]
aws_ecs_task_definition.igsr5_time_management_slack: Refreshing state... [id=igsr5_time_management_slack]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20211124131639569600000001]
aws_s3_bucket_policy.igsr5_images: Refreshing state... [id=igsr5-images]
aws_cloudfront_distribution.igsr5_images: Refreshing state... [id=E1XAVJF6X91WJL]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=alb-log-igsr5]
module.igsr5_debug_server_sg.aws_security_group.default: Refreshing state... [id=sg-0f15df175478bf578]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-083f2270afd84b519]
module.igsr5_debug_server_sg_80.aws_security_group.default: Refreshing state... [id=sg-040051f19452d7214]
aws_subnet.igsr5_public_1: Refreshing state... [id=subnet-0978a0caf7b26a82f]
aws_route_table.igsr5_private: Refreshing state... [id=rtb-061509f2bc59e6ed4]
module.vpc_endpoint_sg.aws_security_group.default: Refreshing state... [id=sg-017d47677fcdff7a6]
aws_subnet.igsr5_private_0: Refreshing state... [id=subnet-091453d20102a88ad]
aws_subnet.igsr5_private_1: Refreshing state... [id=subnet-0411fd95b0c41875f]
aws_subnet.igsr5_public_0: Refreshing state... [id=subnet-0176f59801ec25c61]
aws_internet_gateway.igsr5: Refreshing state... [id=igw-0bccf539544601095]
aws_route_table.igsr5_public: Refreshing state... [id=rtb-0e2514394e6106643]
module.mysql_sg.aws_security_group.default: Refreshing state... [id=sg-0002d9a5dda871298]
module.time_management_slack_sg.aws_security_group.default: Refreshing state... [id=sg-0cde50fa76f677bf0]
aws_route53_record.igsr5_images: Refreshing state... [id=Z10382141794HJUVL4L9O_images.igsr5.com_A]
module.igsr5_debug_server_sg_80.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2964205250]
module.igsr5_debug_server_sg_80.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1863532090]
module.vpc_endpoint_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-4230927273]
module.vpc_endpoint_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3638854328]
module.igsr5_debug_server_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4116799354]
module.igsr5_debug_server_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3862433370]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1166082613]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-753097682]
aws_instance.igsr5_debug_server: Refreshing state... [id=i-01523047055773e58]
aws_route_table_association.igsr5_private_1: Refreshing state... [id=rtbassoc-0b900a3894d983faf]
aws_route_table_association.igsr5_private_0: Refreshing state... [id=rtbassoc-0d89bb588ab1575e3]
aws_db_subnet_group.igsr5: Refreshing state... [id=igsr5]
aws_route_table_association.igsr5_public_1: Refreshing state... [id=rtbassoc-09e062f160e685898]
aws_route_table_association.igsr5_public_0: Refreshing state... [id=rtbassoc-07c598e12997c883b]
aws_lb.igsr5: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:loadbalancer/app/igsr5/e9df5a8fcd5a55c4]
aws_route.igsr5_public: Refreshing state... [id=r-rtb-0e2514394e61066431080289494]
module.time_management_slack_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-280917491]
module.time_management_slack_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3983031859]
module.mysql_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4064317122]
module.mysql_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2767102]
aws_ecs_service.igsr5_time_management_slack: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:799705073177:service/igsr5/igsr5_time_management_slack]
aws_db_instance.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_route53_record.igsr5_sandbox_muson: Refreshing state... [id=Z10382141794HJUVL4L9O_sandbox_muson.igsr5.com_A]
aws_route53_record.igsr5: Refreshing state... [id=Z10382141794HJUVL4L9O_igsr5.com_A]
aws_acm_certificate.igsr5: Refreshing state... [id=arn:aws:acm:ap-northeast-1:799705073177:certificate/93205524-ee35-4db3-a2ec-178c97088452]
aws_route53_record.igsr5_certificate: Refreshing state... [id=Z10382141794HJUVL4L9O__3c5d11fe36cb523dbbd728056ce3e7e9.igsr5.com._CNAME]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:listener/app/igsr5/e9df5a8fcd5a55c4/116a88c60b6c915b]
aws_acm_certificate_validation.igsr5: Refreshing state... [id=2021-12-05 06:06:57 +0000 UTC]
aws_lb_listener_rule.igsr5_sandbox_muson: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:listener-rule/app/igsr5/e9df5a8fcd5a55c4/116a88c60b6c915b/5428e8687e4ec6b6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cloudfront_distribution.igsr5_images has changed
  ~ resource "aws_cloudfront_distribution" "igsr5_images" {
      ~ etag                           = "E2JERA2T2FQAV0" -> "E1TR9VRDBB1ZS6"
        id                             = "E1XAVJF6X91WJL"
      ~ last_modified_time             = "2022-02-19 14:17:15.228 +0000 UTC" -> "2022-03-02 07:09:46.287 +0000 UTC"
        tags                           = {}
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_db_instance.igsr5_sandbox has changed
  ~ resource "aws_db_instance" "igsr5_sandbox" {
        id                                    = "igsr5-sandbox"
      ~ latest_restorable_time                = "2022-02-19T14:15:01Z" -> "2022-04-07T15:20:00Z"
        tags                                  = {}
        # (46 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.igsr5_images has changed
  ~ resource "aws_s3_bucket_policy" "igsr5_images" {
        id     = "igsr5-images"
      ~ policy = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "s3:GetObject"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E13K0L3OQEMWND"
                        }
                        Resource  = "arn:aws:s3:::igsr5-images/*"
                        Sid       = "Allow CloudFront"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.igsr5_gmo_practice_server will be created
  + resource "aws_instance" "igsr5_gmo_practice_server" {
      + ami                                  = (sensitive)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0176f59801ec25c61"
      + tags                                 = {
          + "Name" = "igsr5-gmo-practice-server"
        }
      + tags_all                             = {
          + "Name" = "igsr5-gmo-practice-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.igsr5_gmo_practice_server will be created
  + resource "aws_key_pair" "igsr5_gmo_practice_server" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "igsr5_gmo_practice_server"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCq60lia0S2EnAJfAj3r5y7+QGkXgDLLy4/ECv7d0Akd7t4JaJ49h9o2W3yByKlWJaLsHmocu4xbzk5h+L191los/DSQyUax+n2I1oHlYxyjUVS4OD+Zfi3JHBygcNApIuSvZY0yQR/1mmYHe5m3VCVFnQlVYHr/k45GxXLJR8NNpIABNmIMIhpEpVdlOtpF0nc0GDqBsBOMycwf2ffF7CSBszg7nlOQbgelFhIiielT7IAmFIGVI9JTjNfB49t8AjHefLrkwV16jZ10jkAK2qUQ0gFXJB8lDnow6SQYD+WHlkL26Qgj80e73wADyys4BWkVJYsc/lbX5iOZ/tqYaQGyZFcNIqByiF6At8Q8HjKbKxEt9bl85mYd90E7+c2E+qY5HmKmYqU4/ocIxXyIM6CuhI0oO6Z7kHe0EiZP32EMUWzIPwLB5nsMS+PFNlS3OD6L5fDCVAPfLbWhgH48nFu7nRoY9zzwaoHvqE3MYHy9N/6HC7xN5hJkOyA/lDf2eE= ichigo@Macbook.local"
      + tags_all        = (known after apply)
    }

  # module.http_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "http-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0864c7ab6ca1d76a0"
    }

  # module.http_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.http_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.nginx_sg.aws_security_group.default will be destroyed
  # (because aws_security_group.default is not in configuration)
  - resource "aws_security_group" "default" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:799705073177:security-group/sg-05d50af2b833025ec" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-05d50af2b833025ec" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "nginx-sg" -> null
      - owner_id               = "799705073177" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0864c7ab6ca1d76a0" -> null
    }

  # module.nginx_sg.aws_security_group_rule.egress will be destroyed
  # (because aws_security_group_rule.egress is not in configuration)
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-2680455915" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-05d50af2b833025ec" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.nginx_sg.aws_security_group_rule.ingress will be destroyed
  # (because aws_security_group_rule.ingress is not in configuration)
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "10.0.0.0/16",
        ] -> null
      - from_port         = 80 -> null
      - id                = "sgrule-40824367" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-05d50af2b833025ec" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.ssh_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ssh-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0864c7ab6ca1d76a0"
    }

  # module.ssh_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ssh_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @igsr5, Action: `pull_request`*